zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_ADC.h
#define ADC_EXPSTAT_MUXBIRQ_MASK                 (0x2U)
#define ADC_EXPSTAT_MUXBIRQ_SHIFT                (1U)
/*! MUXBIRQ - ANB4 Expansion AUX Channel Scan Complete Interrupt Request
 *  0b0..A scan cycle is not completed, and no IRQ is pending.
 *  0b1..A scan cycle is completed, and an IRQ is pending.
 */
#define ADC_EXPSTAT_MUXBIRQ(x)                   (((uint16_t)(((uint16_t)(x)) << ADC_EXPSTAT_MUXBIRQ_SHIFT)) & ADC_EXPSTAT_MUXBIRQ_MASK)
/*! @} */

/*! @name EXPCFG - Expansion AUX Config Register */
/*! @{ */

#define ADC_EXPCFG_MUXAIE_MASK                   (0x1U)
#define ADC_EXPCFG_MUXAIE_SHIFT                  (0U)
/*! MUXAIE - ANA4 Expansion AUX Channel Scan Complete Interrupt Enable
 *  0b0..Interrupt disabled.
 *  0b1..Interrupt enabled.
 */
#define ADC_EXPCFG_MUXAIE(x)                     (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXAIE_SHIFT)) & ADC_EXPCFG_MUXAIE_MASK)

#define ADC_EXPCFG_MUXBIE_MASK                   (0x2U)
#define ADC_EXPCFG_MUXBIE_SHIFT                  (1U)
/*! MUXBIE - ANB4 Expansion AUX Channel Scan Complete Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled.
 */
#define ADC_EXPCFG_MUXBIE(x)                     (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXBIE_SHIFT)) & ADC_EXPCFG_MUXBIE_MASK)

#define ADC_EXPCFG_MUXARST_MASK                  (0x4U)
#define ADC_EXPCFG_MUXARST_SHIFT                 (2U)
/*! MUXARST - ANA4 Expansion AUX Scan Reset
 *  0b0..Does not reset.
 *  0b1..Resets.
 */
#define ADC_EXPCFG_MUXARST(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXARST_SHIFT)) & ADC_EXPCFG_MUXARST_MASK)

#define ADC_EXPCFG_MUXBRST_MASK                  (0x8U)
#define ADC_EXPCFG_MUXBRST_SHIFT                 (3U)
/*! MUXBRST - ANB4 Expansion AUX Scan Reset
 *  0b0..Does not reset.
 *  0b1..Resets.
 */
#define ADC_EXPCFG_MUXBRST(x)                    (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXBRST_SHIFT)) & ADC_EXPCFG_MUXBRST_MASK)

#define ADC_EXPCFG_MUXSCTR4A_MASK                (0x30U)
#define ADC_EXPCFG_MUXSCTR4A_SHIFT               (4U)
/*! MUXSCTR4A - ANA4 Expansion AUX Channel Scan Control
 *  0b00..Manual select: The EXPAUX4A[AUXSEL0] bits control output signals AUXA_SEL0 and AUXA_SEL1.
 *  0b01..Scan mode 0: The sample completion of ANA4 enables subsequent selected channel.
 *  0b10..Scan mode 1: The sample completion of ADCA on-chip analog signal (see the chip-specific information
 *        section) enables subsequent selected channel.
 *  0b11..Scan mode 2: The sample completion of either ANA4 or ADCA on-chip analog signal enables subsequent selected channel.
 */
#define ADC_EXPCFG_MUXSCTR4A(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXSCTR4A_SHIFT)) & ADC_EXPCFG_MUXSCTR4A_MASK)

#define ADC_EXPCFG_MUXSCTR4B_MASK                (0xC0U)
#define ADC_EXPCFG_MUXSCTR4B_SHIFT               (6U)
/*! MUXSCTR4B - ANB4 Expansion AUX Channel Scan Control
 *  0b00..Manual select: The EXPAUX4B[AUXSEL0] bits control output signals AUXB_SEL0 and AUXB_SEL1.
 *  0b01..Scan mode 0: The sample completion of ANB4 enables subsequent selected channel.
 *  0b10..Scan mode 1: The sample completion of ADCB on-chip analog signal (see the chip-specific information
 *        section) enables subsequent selected channel.
 *  0b11..Scan mode 2: The sample completion of either ANB4 or ADCB on-chip analog signal enables subsequent selected channel.
 */
#define ADC_EXPCFG_MUXSCTR4B(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPCFG_MUXSCTR4B_SHIFT)) & ADC_EXPCFG_MUXSCTR4B_MASK)
/*! @} */

/*! @name EXPAUX4A - ANA4 Expansion Auxiliary Control Register */
/*! @{ */

#define ADC_EXPAUX4A_AUXSEL0_MASK                (0x3U)
#define ADC_EXPAUX4A_AUXSEL0_SHIFT               (0U)
/*! AUXSEL0 - Auxiliary Select 0 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL0_SHIFT)) & ADC_EXPAUX4A_AUXSEL0_MASK)

#define ADC_EXPAUX4A_AUXSEL1_MASK                (0xCU)
#define ADC_EXPAUX4A_AUXSEL1_SHIFT               (2U)
/*! AUXSEL1 - Auxiliary Select 1 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL1_SHIFT)) & ADC_EXPAUX4A_AUXSEL1_MASK)

#define ADC_EXPAUX4A_AUXSEL2_MASK                (0x30U)
#define ADC_EXPAUX4A_AUXSEL2_SHIFT               (4U)
/*! AUXSEL2 - Auxiliary Select 2 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL2_SHIFT)) & ADC_EXPAUX4A_AUXSEL2_MASK)

#define ADC_EXPAUX4A_AUXSEL3_MASK                (0xC0U)
#define ADC_EXPAUX4A_AUXSEL3_SHIFT               (6U)
/*! AUXSEL3 - Auxiliary Select 3 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL3_SHIFT)) & ADC_EXPAUX4A_AUXSEL3_MASK)

#define ADC_EXPAUX4A_AUXSEL4_MASK                (0x300U)
#define ADC_EXPAUX4A_AUXSEL4_SHIFT               (8U)
/*! AUXSEL4 - Auxiliary Select 4 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL4_SHIFT)) & ADC_EXPAUX4A_AUXSEL4_MASK)

#define ADC_EXPAUX4A_AUXSEL5_MASK                (0xC00U)
#define ADC_EXPAUX4A_AUXSEL5_SHIFT               (10U)
/*! AUXSEL5 - Auxiliary Select 5 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL5_SHIFT)) & ADC_EXPAUX4A_AUXSEL5_MASK)

#define ADC_EXPAUX4A_AUXSEL6_MASK                (0x3000U)
#define ADC_EXPAUX4A_AUXSEL6_SHIFT               (12U)
/*! AUXSEL6 - Auxiliary Select 6 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL6_SHIFT)) & ADC_EXPAUX4A_AUXSEL6_MASK)

#define ADC_EXPAUX4A_AUXSEL7_MASK                (0xC000U)
#define ADC_EXPAUX4A_AUXSEL7_SHIFT               (14U)
/*! AUXSEL7 - Auxiliary Select 7 controls AUXA_SEL0 and AUXA_SEL1
 *  0b00..AUXA_SEL1 = 0; AUXA_SEL0 = 0.
 *  0b01..AUXA_SEL1 = 0; AUXA_SEL0 = 1.
 *  0b10..AUXA_SEL1 = 1; AUXA_SEL0 = 0.
 *  0b11..AUXA_SEL1 = 1; AUXA_SEL0 = 1.
 */
#define ADC_EXPAUX4A_AUXSEL7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4A_AUXSEL7_SHIFT)) & ADC_EXPAUX4A_AUXSEL7_MASK)
/*! @} */

