zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_ADC.h
/*! @name EXPAUX4B - ANB4 Expansion Auxiliary Control Register */
/*! @{ */

#define ADC_EXPAUX4B_AUXSEL0_MASK                (0x3U)
#define ADC_EXPAUX4B_AUXSEL0_SHIFT               (0U)
/*! AUXSEL0 - Auxiliary Select 0 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL0_SHIFT)) & ADC_EXPAUX4B_AUXSEL0_MASK)

#define ADC_EXPAUX4B_AUXSEL1_MASK                (0xCU)
#define ADC_EXPAUX4B_AUXSEL1_SHIFT               (2U)
/*! AUXSEL1 - Auxiliary Select 1 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL1_SHIFT)) & ADC_EXPAUX4B_AUXSEL1_MASK)

#define ADC_EXPAUX4B_AUXSEL2_MASK                (0x30U)
#define ADC_EXPAUX4B_AUXSEL2_SHIFT               (4U)
/*! AUXSEL2 - Auxiliary Select 2 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL2_SHIFT)) & ADC_EXPAUX4B_AUXSEL2_MASK)

#define ADC_EXPAUX4B_AUXSEL3_MASK                (0xC0U)
#define ADC_EXPAUX4B_AUXSEL3_SHIFT               (6U)
/*! AUXSEL3 - Auxiliary Select 3 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL3_SHIFT)) & ADC_EXPAUX4B_AUXSEL3_MASK)

#define ADC_EXPAUX4B_AUXSEL4_MASK                (0x300U)
#define ADC_EXPAUX4B_AUXSEL4_SHIFT               (8U)
/*! AUXSEL4 - Auxiliary Select 4 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL4_SHIFT)) & ADC_EXPAUX4B_AUXSEL4_MASK)

#define ADC_EXPAUX4B_AUXSEL5_MASK                (0xC00U)
#define ADC_EXPAUX4B_AUXSEL5_SHIFT               (10U)
/*! AUXSEL5 - Auxiliary Select 5 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL5_SHIFT)) & ADC_EXPAUX4B_AUXSEL5_MASK)

#define ADC_EXPAUX4B_AUXSEL6_MASK                (0x3000U)
#define ADC_EXPAUX4B_AUXSEL6_SHIFT               (12U)
/*! AUXSEL6 - Auxiliary Select 6 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL6_SHIFT)) & ADC_EXPAUX4B_AUXSEL6_MASK)

#define ADC_EXPAUX4B_AUXSEL7_MASK                (0xC000U)
#define ADC_EXPAUX4B_AUXSEL7_SHIFT               (14U)
/*! AUXSEL7 - Auxiliary Select 7 controls AUXB_SEL0 and AUXB_SEL1
 *  0b00..AUXB_SEL1 = 0; AUXB_SEL0 = 0.
 *  0b01..AUXB_SEL1 = 0; AUXB_SEL0 = 1.
 *  0b10..AUXB_SEL1 = 1; AUXB_SEL0 = 0.
 *  0b11..AUXB_SEL1 = 1; AUXB_SEL0 = 1.
 */
#define ADC_EXPAUX4B_AUXSEL7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPAUX4B_AUXSEL7_SHIFT)) & ADC_EXPAUX4B_AUXSEL7_MASK)
/*! @} */

/*! @name EXPMUX4A0 - ANA4 Expansion MUX Control Register 0 */
/*! @{ */

#define ADC_EXPMUX4A0_MSDIS0_MASK                (0x8U)
#define ADC_EXPMUX4A0_MSDIS0_SHIFT               (3U)
/*! MSDIS0 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL0 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS0_SHIFT)) & ADC_EXPMUX4A0_MSDIS0_MASK)

#define ADC_EXPMUX4A0_MSDIS1_MASK                (0x80U)
#define ADC_EXPMUX4A0_MSDIS1_SHIFT               (7U)
/*! MSDIS1 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL1 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS1_SHIFT)) & ADC_EXPMUX4A0_MSDIS1_MASK)

#define ADC_EXPMUX4A0_MSDIS2_MASK                (0x800U)
#define ADC_EXPMUX4A0_MSDIS2_SHIFT               (11U)
/*! MSDIS2 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL2 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS2_SHIFT)) & ADC_EXPMUX4A0_MSDIS2_MASK)

#define ADC_EXPMUX4A0_MSDIS3_MASK                (0x8000U)
#define ADC_EXPMUX4A0_MSDIS3_SHIFT               (15U)
/*! MSDIS3 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops AUXSEL3 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A0_MSDIS3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A0_MSDIS3_SHIFT)) & ADC_EXPMUX4A0_MSDIS3_MASK)
/*! @} */

/*! @name EXPMUX4A1 - ANA4 Expansion MUX Control Register 1 */
/*! @{ */

#define ADC_EXPMUX4A1_MSDIS4_MASK                (0x8U)
#define ADC_EXPMUX4A1_MSDIS4_SHIFT               (3U)
/*! MSDIS4 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL4 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS4_SHIFT)) & ADC_EXPMUX4A1_MSDIS4_MASK)

#define ADC_EXPMUX4A1_MSDIS5_MASK                (0x80U)
#define ADC_EXPMUX4A1_MSDIS5_SHIFT               (7U)
/*! MSDIS5 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL5 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS5_SHIFT)) & ADC_EXPMUX4A1_MSDIS5_MASK)

#define ADC_EXPMUX4A1_MSDIS6_MASK                (0x800U)
#define ADC_EXPMUX4A1_MSDIS6_SHIFT               (11U)
/*! MSDIS6 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL6 are served, and the scan sequence resets to EXPAUX4A[AUXSEL0].
 */
#define ADC_EXPMUX4A1_MSDIS6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS6_SHIFT)) & ADC_EXPMUX4A1_MSDIS6_MASK)

#define ADC_EXPMUX4A1_MSDIS7_MASK                (0x8000U)
#define ADC_EXPMUX4A1_MSDIS7_SHIFT               (15U)
/*! MSDIS7 - AUX Select Disable */
#define ADC_EXPMUX4A1_MSDIS7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4A1_MSDIS7_SHIFT)) & ADC_EXPMUX4A1_MSDIS7_MASK)
/*! @} */

