zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_ADC.h
/*! @name EXPMUX4B0 - ANB4 Expansion MUX Control Register 0 */
/*! @{ */

#define ADC_EXPMUX4B0_MSDIS0_MASK                (0x8U)
#define ADC_EXPMUX4B0_MSDIS0_SHIFT               (3U)
/*! MSDIS0 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL0 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS0(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS0_SHIFT)) & ADC_EXPMUX4B0_MSDIS0_MASK)

#define ADC_EXPMUX4B0_MSDIS1_MASK                (0x80U)
#define ADC_EXPMUX4B0_MSDIS1_SHIFT               (7U)
/*! MSDIS1 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL1 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS1(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS1_SHIFT)) & ADC_EXPMUX4B0_MSDIS1_MASK)

#define ADC_EXPMUX4B0_MSDIS2_MASK                (0x800U)
#define ADC_EXPMUX4B0_MSDIS2_SHIFT               (11U)
/*! MSDIS2 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL2 are served, and the scan sequence resets and EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS2(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS2_SHIFT)) & ADC_EXPMUX4B0_MSDIS2_MASK)

#define ADC_EXPMUX4B0_MSDIS3_MASK                (0x8000U)
#define ADC_EXPMUX4B0_MSDIS3_SHIFT               (15U)
/*! MSDIS3 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL3 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B0_MSDIS3(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B0_MSDIS3_SHIFT)) & ADC_EXPMUX4B0_MSDIS3_MASK)
/*! @} */

/*! @name EXPMUX4B1 - ANB4 Expansion MUX Control Register 1 */
/*! @{ */

#define ADC_EXPMUX4B1_MSDIS4_MASK                (0x8U)
#define ADC_EXPMUX4B1_MSDIS4_SHIFT               (3U)
/*! MSDIS4 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL4 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS4(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS4_SHIFT)) & ADC_EXPMUX4B1_MSDIS4_MASK)

#define ADC_EXPMUX4B1_MSDIS5_MASK                (0x80U)
#define ADC_EXPMUX4B1_MSDIS5_SHIFT               (7U)
/*! MSDIS5 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL5 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS5(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS5_SHIFT)) & ADC_EXPMUX4B1_MSDIS5_MASK)

#define ADC_EXPMUX4B1_MSDIS6_MASK                (0x800U)
#define ADC_EXPMUX4B1_MSDIS6_SHIFT               (11U)
/*! MSDIS6 - AUX Select Disable
 *  0b0..Expansion AUX scan continues.
 *  0b1..Expansion AUX scan stops after AUXSEL6 are served, and the scan sequence resets to EXPAUX4B[AUXSEL0].
 */
#define ADC_EXPMUX4B1_MSDIS6(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS6_SHIFT)) & ADC_EXPMUX4B1_MSDIS6_MASK)

#define ADC_EXPMUX4B1_MSDIS7_MASK                (0x8000U)
#define ADC_EXPMUX4B1_MSDIS7_SHIFT               (15U)
/*! MSDIS7 - AUX Select Disable */
#define ADC_EXPMUX4B1_MSDIS7(x)                  (((uint16_t)(((uint16_t)(x)) << ADC_EXPMUX4B1_MSDIS7_SHIFT)) & ADC_EXPMUX4B1_MSDIS7_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group ADC_Register_Masks */

/* Backward compatibility */
#define ADC_CAL_SEL_VREFLO_A_MASK                ADC_CAL_SEL_VREFL_A_MASK
#define ADC_CAL_SEL_VREFLO_A_SHIFT               ADC_CAL_SEL_VREFL_A_SHIFT
#define ADC_CAL_SEL_VREFLO_A(x)                  ADC_CAL_SEL_VREFL_A(x)
#define ADC_CAL_SEL_VREFLO_B_MASK                ADC_CAL_SEL_VREFL_B_MASK
#define ADC_CAL_SEL_VREFLO_B_SHIFT               ADC_CAL_SEL_VREFL_B_SHIFT
#define ADC_CAL_SEL_VREFLO_B(x)                  ADC_CAL_SEL_VREFL_B(x)


/*!
 * @}
 */ /* end of group ADC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__CWCC__)
  #pragma pop
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_ADC_H_ */

